### Connect to MySQL database

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
connection_string = "mysql://root:{password}@localhost:3306/shot_chicago_db"
engine = create_engine(connection_string)

In [3]:
engine.table_names()

['censusdata', 'crimedata', 'flushot']

### Load cleaned dataframe and export to MySQL

In [4]:
#Load census dataframe
cleaned_census_df = pd.read_csv("cleaned_census_df.csv")

In [ ]:
#Load dataframe into SQL
cleaned_census_df.to_sql(name='censusdata', con=engine, if_exists='append', index=False)

In [ ]:
#Confirm data has been added
pd.read_sql_query('select * from censusdata', con=engine).head()

,Unnamed: 0,community_area_number,Area,<19y,20-34y,35-59y,50-64y,65-74y,75-84y,85y<,...,ASSOC,BACH,GRAD_PROF,INC_LT_25K,INC_25_50K,INC_50_75K,INC_75_100K,INC_100_150K,INC_GT_150,median_income
0,0.0,1.0,Rogers Park,12092,16967,12526,9130,2718,1268,799,...,1825,9693,6627,8558,6268,4048,2167,1944,1273,37549
1,1.0,2.0,West Ridge,19951,16264,14581,13704,5138,2765,1320,...,2830,12247,7161,6180,6501,3965,2652,3302,2182,48701
2,2.0,3.0,Uptown,7030,18725,13253,10706,3333,1977,1272,...,2329,15315,9176,9629,5794,4321,3120,3293,3079,45644
3,3.0,4.0,Lincoln Square,7306,13696,10180,6588,2228,976,509,...,1527,11589,7831,3263,3987,3043,2512,2745,2882,66393
4,4.0,5.0,North Center,8266,10302,9454,4024,1602,808,486,...,925,10509,7017,1416,1870,2185,1986,2677,4415,97703

In [ ]:
#Load flushot dataframe
cleaned_flu_df = pd.read_csv("cleaned_flu_df.csv")

In [ ]:
#Load dataframe into SQL
cleaned_flu_df.to_sql(name='flushot', con=engine, if_exists='append', index=False)

In [ ]:
#Confirm data has been added
pd.read_sql_query('select * from flushot', con=engine).head()

,Unnamed: 0,Season,Latitude,Longitude,Postal Code,community_area_number
0,0.0,2017-2018,41.968500,-87.728760,60630,14.0
1,1.0,2015-2016,41.981429,-87.668555,60640,76.0
2,2.0,2015-2016,41.884543,-87.627803,60601,38.0
3,3.0,2015-2016,41.844305,-87.707719,60623,32.0
4,4.0,2016-2017,41.968300,-87.738086,60630,14.0

In [ ]:
#Load crimedata dataframe
crimedata_df = pd.read_csv("crime2013_2019.csv")
crimedata_df = crimedata_df.rename(columns={"Community Area":"community_area_number"})

In [ ]:
#Load CSV into SQL
crimedata_df.to_sql(name='crimedata', con=engine, if_exists='append', index=False)

In [ ]:
#Confirm data has been added
pd.read_sql_query('select * from crimedata', con=engine).head()

,Unnamed: 0,ID,Date,Primary Type,Location Description,Arrest,community_area_number,Year,Latitude,Longitude,Time,AmPm
0,0,11668131,04/26/2019,DECEPTIVE PRACTICE,GAS STATION,0,25.0,2019,41.912867,-87.765636,11:58:00,PM
1,1,11668274,04/26/2019,BURGLARY,APARTMENT,0,24.0,2019,41.896700,-87.655246,11:58:00,PM
2,2,11668155,04/26/2019,NARCOTICS,PARK PROPERTY,1,15.0,2019,41.965938,-87.781969,11:56:00,PM
3,3,11668197,04/26/2019,WEAPONS VIOLATION,STREET,1,71.0,2019,41.743674,-87.634697,11:51:00,PM
4,4,11668158,04/26/2019,BATTERY,APARTMENT,0,25.0,2019,41.876749,-87.747879,11:49:00,PM

### Combine tables in SQL

In [5]:
#Combine flushot data and census data

query = """
SELECT
*
FROM censusdata A
INNER JOIN flushot B on A.community_area_number = B.community_area_number
"""

pd.read_sql_query(query, con=engine).head()

,Unnamed: 0,community_area_number,Area,<19y,20-34y,35-59y,50-64y,65-74y,75-84y,85y<,...,INC_75_100K,INC_100_150K,INC_GT_150,median_income,Unnamed: 0,Season,Latitude,Longitude,Postal Code,community_area_number
0,13.0,14.0,Albany Park,13354,13738,11975,8232,2329,1343,604,...,2091,2259,1632,55561,0.0,2017-2018,41.9685,-87.72876,60630,14.0
1,13.0,14.0,Albany Park,13354,13738,11975,8232,2329,1343,604,...,2091,2259,1632,55561,0.0,2017-2018,41.9685,-87.72876,60630,14.0
2,NaN,14.0,Albany Park,13354,13738,11975,8232,2329,1343,604,...,2091,2259,1632,55561,0.0,2017-2018,41.9685,-87.72876,60630,14.0
3,13.0,14.0,Albany Park,13354,13738,11975,8232,2329,1343,604,...,2091,2259,1632,55561,0.0,2017-2018,41.9685,-87.72876,60630,14.0
4,NaN,14.0,Albany Park,13354,13738,11975,8232,2329,1343,604,...,2091,2259,1632,55561,0.0,2017-2018,41.9685,-87.72876,60630,14.0